{
  "count": 90,
  "podcasts": [
    {
      "cover_image": "/podcast-covers/50-years-of-music-w-50-year-old-white-guys.jpeg",
      "legacy_url": "https://electracast.com/podcast/50-years-of-music-w-50-year-old-white-guys/",
      "slug": "50-years-of-music-w-50-year-old-white-guys",
      "source_dir": "50_Years_of_Music_w_50_Year_Old_White_Guys",
      "summary": "Travel back in time, year by year, with three 50 year olds to find out what was happening back in the day and which song is actually the best song for each year they've been alive.",
      "title": "50 Years of Music w/ 50 Year Old White Guys"
    },
    {
      "cover_image": "/podcast-covers/abracadabra-create-what-you-speak.png",
      "legacy_url": "https://electracast.com/podcast/abracadabra-create-what-you-speak/",
      "slug": "abracadabra-create-what-you-speak",
      "source_dir": "Abracadabra_Create_What_You_Speak",
      "summary": "Abracadabra: Create What You Speak, is An empowerment program, with guests from all over the world who will share their light and their gifts of Art, knowledge and wisdom to inspire you to be the best version of yourself.",
      "title": "Abracadabra: Create What You Speak"
    },
    {
      "cover_image": "/podcast-covers/abundance-blueprint-with-kimberly.png",
      "legacy_url": "https://electracast.com/podcast/abundance-blueprint-with-kimberly/",
      "slug": "abundance-blueprint-with-kimberly",
      "source_dir": "Abundance_Blueprint_With_Kimberly",
      "summary": "Content Creator Kimberly Layne Roberts is the Founder of Performance Leadership Intl. She is dedicated to helping women entrepreneurs design a wealthy lifestyle both inside and out by incorporating wealth wisdom tools, tips and resources that empower them personally and professionally on her globally recognized show Wealth And Woman With Kimberly.",
      "title": "Abundance Blueprint With Kimberly"
    },
    {
      "cover_image": "/podcast-covers/adventures-to-wisdom.png",
      "legacy_url": "https://electracast.com/podcast/adventures-to-wisdom/",
      "slug": "adventures-to-wisdom",
      "source_dir": "Adventures_To_Wisdom",
      "summary": "Welcome, I’m Gina, What if you could get answers to your deepest questions?Reawaken your sense of purpose? and enhance your zest for connection and play?",
      "title": "Adventures To Wisdom"
    },
    {
      "cover_image": "/podcast-covers/airquote-law-pod.png",
      "legacy_url": "https://electracast.com/podcast/airquote-law-pod/",
      "slug": "airquote-law-pod",
      "source_dir": "Airquote_Law_Pod",
      "summary": "Airquote Law Pod is the Law podcast that is not a law podcast. Join a few of Maryland and DC attorneys as they talk about all sorts of who knows what, and a sprinkling of law related topics from time to time.",
      "title": "Airquote Law Pod"
    },
    {
      "cover_image": "/podcast-covers/all-things-creepy.jpeg",
      "legacy_url": "https://electracast.com/podcast/all-things-creepy/",
      "slug": "all-things-creepy",
      "source_dir": "All_Things_Creepy",
      "summary": "For thousands of years people have been fascinated with the creepy things in life. And I'm no exception. Join me, Micah James, every weekend as I dive into a new creepy topic!",
      "title": "All Things Creepy"
    },
    {
      "cover_image": "/podcast-covers/asked-and-answered-by-soul.jpeg",
      "legacy_url": "https://electracast.com/podcast/asked-and-answered-by-soul/",
      "slug": "asked-and-answered-by-soul",
      "source_dir": "Asked_and_Answered_by_Soul",
      "summary": "Jennifer Urezzio, founder of Soul Language is dedicated to providing her listeners with tangible tools to embody their Divinity and create a life based on Freedom. Asked and Answered by Soul focuses on topics that will guide you to listening and utilizing your essential nature. During each show, Jennifer asks an expert three key questions so you can understand that you are not alone on this journey and that your Soul is the key to forming a life full of abundance, purpose, and passion. The goal of each interview is for you to take away a practice that you can do right now to change your life and understand what assistance is out there in the Universe to support you.",
      "title": "Asked and Answered by Soul"
    },
    {
      "cover_image": "/podcast-covers/athletic-obscura.png",
      "legacy_url": "https://electracast.com/podcast/athletic-obscura/",
      "slug": "athletic-obscura",
      "source_dir": "Athletic_Obscura",
      "summary": "Home of the weird, strange and unknown in sports. Join sports and history aficionados Seth Moorman and Rich Manning as they discuss some of the more obscure events in the world of athletics. Take a deep dive into stories that never made the front page of the newspaper, or have been almost lost to history and, along the way, learn how these events continue to shape the landscape of our world to this day.",
      "title": "Athletic Obscura"
    },
    {
      "cover_image": "/podcast-covers/avhd.jpeg",
      "legacy_url": "https://electracast.com/podcast/avhd/",
      "slug": "avhd",
      "source_dir": "AVHD",
      "summary": "Hunter & Ryan Talk. We like things that are good. Consume content.",
      "title": "AVHD"
    },
    {
      "cover_image": "/podcast-covers/behind-the-rock-with-dc.jpeg",
      "legacy_url": "https://electracast.com/podcast/behind-the-rock-with-dc/",
      "slug": "behind-the-rock-with-dc",
      "source_dir": "Behind_the_Rock_with_DC",
      "summary": "Our host, DC, has been in radio for years, and being on three stations, he speaks with a lot of musicians and artists. And we are bringing those radio interviews to you on \"Behind The Rock\". You will hear people from bands ranging from hair metal, hard rock, melodic rock and even country music. DC can be heard on 103.5 The Shark weekdays 3-7pm Eastern. Also, on 99.9 Rockcast Radio Sat/Sun from 5pm-10pm Eastern. He also hosts a show on 96.9 Dirt Road Radio weekends from 3-8pm Eastern. He also hosts the syndicated show \"Hair On The Air\". You can get links to everything DC does and reach out directly to him at Linktree.com/RadioDC. Bookmark this podcast to hear the conversations with all kinds of artists on \"Behind The Rock\".",
      "title": "Behind the Rock with DC"
    },
    {
      "cover_image": "/podcast-covers/being-your-own-superstar.jpeg",
      "legacy_url": "https://electracast.com/podcast/being-your-own-superstar/",
      "slug": "being-your-own-superstar",
      "source_dir": "Being_Your_Own_Superstar",
      "summary": "The founder of Joie G 113 Joie Gharrity observed superstars while working in Hollywood entertainment business for 15+ years and has discover their secret sauce. She shares the secret sauce to your dreams and desires coming to fruition has to do with how much love you can allow, receive, and accept. . Money, adoration... are just love in different forms. She shares a tool and tip on each episode to grow what she has coined as your Love Capacity or LC for short. She also interviews guest that share how they have grown their LC and how it has impacted their personal and professional life in the most extraordinary ways.",
      "title": "Being Your Own Superstar"
    },
    {
      "cover_image": "/podcast-covers/big-truth-encouragement.png",
      "legacy_url": "https://electracast.com/podcast/big-truth-encouragement/",
      "slug": "big-truth-encouragement",
      "source_dir": "Big_Truth_Encouragement",
      "summary": "\"Today is working for me!\" Do you believe that? Do you remind yourself of this truth? Pastor Julie imparts encouragement in each episode as she unpacks living a faith-filled life. Enjoy tropical conversations of real-life experiences combined with Biblical truths.",
      "title": "Big Truth Encouragement"
    },
    {
      "cover_image": "/podcast-covers/bodacious-minds.jpeg",
      "legacy_url": "https://electracast.com/podcast/bodacious-minds/",
      "slug": "bodacious-minds",
      "source_dir": "Bodacious_Minds",
      "summary": "Former Playboy Playmate turned entrepreneur, Yvette Lopez, leads no-holds-barred, often hilarious conversations about sex, relationships, trauma, healing, owning your choices and living your life free of shame.  She shares her own experiences with jaw-dropping frankness while trading stories and wisdom with guests from the worlds of celebrity, healing, professional sports and professional sex. Be smart, be sexy, own it. An ElectraCast podcast.",
      "title": "Bodacious Minds"
    },
    {
      "cover_image": "/podcast-covers/brain-arcade.png",
      "legacy_url": "https://electracast.com/podcast/brain-arcade/",
      "slug": "brain-arcade",
      "source_dir": "Brain_Arcade",
      "summary": "Unlock the secrets of impactful game design with Brain Arcade! Join Creative Director Chris Cross, a 30+ year industry veteran, as he dives into his insights on building engaging games and mastering the art of communicating with your audience. Looking for deeper knowledge that you can actually apply? Chris and his diverse guests from various professions examine theories and uncover fresh perspectives to validate or debunk Chris' experiential knowledge. Get ready to learn, challenge ideas, and elevate your brain.",
      "title": "Brain Arcade"
    },
    {
      "cover_image": "/podcast-covers/brilliant-marketing-with-mary.jpg",
      "legacy_url": "https://electracast.com/podcast/brilliant-marketing-with-mary/",
      "slug": "brilliant-marketing-with-mary",
      "source_dir": "Brilliant_Marketing_With_Mary",
      "summary": "Content Creator Mary Barnett, also know as \"MobileMary\" is the Founder of Another Brilliant Idea. She is dedicated to helping women entrepreneurs grow their business with Digital Marketing & Communication tools, tips and resources that empower them to be bold and stand in their brilliance on her globally recognized show Brilliant Marketing With Mary.",
      "title": "Brilliant Marketing With Mary"
    },
    {
      "cover_image": "/podcast-covers/business-kare-with-kerstin.jpeg",
      "legacy_url": "https://electracast.com/podcast/business-kare-with-kerstin/",
      "slug": "business-kare-with-kerstin",
      "source_dir": "Business_Kare_With_Kerstin",
      "summary": "Content Creator Kerstin O’Shields is the founder of Business Leadership Excellence Institute. She is on a mission to help women entrepreneurs stop struggling in their business by incorporating leadership and mindset tools, tips and resources that magnetize a successful business on her globally recognized show Business Kare With Kerstin.",
      "title": "Business Kare With Kerstin"
    },
    {
      "cover_image": "/podcast-covers/career-advancement-with-craig-ancel.png",
      "legacy_url": "https://electracast.com/podcast/career-advancement-with-craig-ancel/",
      "slug": "career-advancement-with-craig-ancel",
      "source_dir": "Career_Advancement_with_Craig_Ancel",
      "summary": "If you’re a working professional wondering what’s next for your career, you’ve come to the right place.",
      "title": "Career Advancement with Craig Ancel"
    },
    {
      "cover_image": "/podcast-covers/cinematic-revelations.png",
      "legacy_url": "https://electracast.com/podcast/cinematic-revelations/",
      "slug": "cinematic-revelations",
      "source_dir": "Cinematic_Revelations",
      "summary": "Join podcaster, and blogger, Athan Jonacas, as he delves deeply into the world of film, separating the sterling hits from the misses, on his CINEMATIC REVELATIONS podcast.",
      "title": "Cinematic Revelations"
    },
    {
      "cover_image": "/podcast-covers/congressional-record-daily-digest.png",
      "legacy_url": "https://electracast.com/podcast/congressional-record-daily-digest/",
      "slug": "congressional-record-daily-digest",
      "source_dir": "Congressional_Record_Daily_Digest",
      "summary": "Get a clear, unbiased look into Capitol Hill's activities through concise, factual summaries of the Senate and House of Representatives' sessions. Our content comes directly from the official Congressional Record, ensuring listeners get the most accurate information about the daily workings of the U.S. Congress in four minutes or less.",
      "title": "Congressional Record Daily Digest"
    },
    {
      "cover_image": "/podcast-covers/cosmic-love-antenna.jpeg",
      "legacy_url": "https://electracast.com/podcast/cosmic-love-antenna/",
      "slug": "cosmic-love-antenna",
      "source_dir": "Cosmic_Love_Antenna",
      "summary": "Venture on a mystical voyage from the intellect to the soul, delving deep into the mysteries of love's spiritual essence and unfolding. This podcast, hosted by Harrison Meagher, celebrates the peeling back of heart layers, revealing profound lessons, interviews with spiritual seekers, and practices to open your heart to love's infinite wisdom.",
      "title": "Cosmic Love Antenna"
    },
    {
      "cover_image": "/podcast-covers/creators-getting-paid.png",
      "legacy_url": "https://electracast.com/podcast/creators-getting-paid/",
      "slug": "creators-getting-paid",
      "source_dir": "Creators_Getting_Paid",
      "summary": "The creator economy is here! With the great resignation, the world is changing. On this podcast we educate you on being a creator and getting paid to be who you are. We're releasing two episodes every week so you can get paid. Welcome to profitability!",
      "title": "Creators Getting Paid"
    },
    {
      "cover_image": "/podcast-covers/crypto-with-kamal.png",
      "legacy_url": "https://electracast.com/podcast/crypto-with-kamal/",
      "slug": "crypto-with-kamal",
      "source_dir": "Crypto_with_Kamal",
      "summary": "Crypto with Kamal is an insightful podcast for anyone navigating the fascinating world of cryptocurrencies. Join your host, Kamal, as he unpacks the complexities of blockchain technology, digital currencies, and the ever-evolving crypto landscape. In each edition, Kamal conducts engaging discussions with industry experts, innovators, and market analysts, bringing you the latest trends and developments in the crypto space.",
      "title": "Crypto with Kamal"
    },
    {
      "cover_image": "/podcast-covers/deep-leadership.jpeg",
      "legacy_url": "https://electracast.com/podcast/deep-leadership/",
      "slug": "deep-leadership",
      "source_dir": "Deep_Leadership",
      "summary": "“Leadership is a People Business.” That's the philosophy of this leadership podcast from Jon Rennie. It's real-world, actionable advice from Jon as well as his expert guests. As a former Cold War Submarine Officer who spent 22 years leading businesses in Corporate America before starting his own manufacturing business, he knows that leadership matters!",
      "title": "Deep Leadership"
    },
    {
      "cover_image": "/podcast-covers/dollar-betz.png",
      "legacy_url": "https://electracast.com/podcast/dollar-betz/",
      "slug": "dollar-betz",
      "source_dir": "dOllar_betZ",
      "summary": "Two Sports Geniuses Debate, Recap, and Predict Sportsball Games. And Gamble Real Money On Air.",
      "title": "dOllar betZ"
    },
    {
      "cover_image": "/podcast-covers/eazy-does-it-podcast.png",
      "legacy_url": "https://electracast.com/podcast/eazy-does-it-podcast/",
      "slug": "eazy-does-it-podcast",
      "source_dir": "Eazy_Does_It_Podcast",
      "summary": "Eazy Does It is a platform for artists, creatives, leaders, & business owners in Austin, TX. Our goal is the preservation of culture & the introduction of unique perspectives through storytelling. Eazy Does It is the ear to the ground of what is current amidst our culture here in Austin, TX, and celebrates individuals that are contributing to the betterment of our city in unique ways. Now we are expanding on a national & global level to celebrate artists contributing to their communities. By using our voices and stories to inspire action far and wide we create a sense of relatability between strangers on platforms that we frequent everyday.",
      "title": "Eazy Does It Podcast"
    },
    {
      "cover_image": "/podcast-covers/electracast-behind-the-scenes.png",
      "legacy_url": "https://electracast.com/podcast/electracast-behind-the-scenes/",
      "slug": "electracast-behind-the-scenes",
      "source_dir": "ElectraCast_Behind_the_Scenes",
      "summary": "Looking for backstage interviews with ElectraCast hosts, actors and creators of great podcasts? ElectraCast Behind the Scenes is where you will find inside stories, secrets and backgrounds exploring the untold and unseen truths of ElectraCast Media's mission \"to create community and amplify diverse voices through compelling entertainment and story.\"  Visit us at www.electracast.com.",
      "title": "ElectraCast Behind the Scenes"
    },
    {
      "cover_image": "/podcast-covers/entrepreneurs-exposed.jpeg",
      "legacy_url": "https://electracast.com/podcast/entrepreneurs-exposed/",
      "slug": "entrepreneurs-exposed",
      "source_dir": "Entrepreneurs_Exposed",
      "summary": "E2, hosted by Canadian entrepreneur Adam Levinter, is a business long-form interview-style podcast, showcasing some of the most influential creators and founders in entrepreneurship.",
      "title": "Entrepreneurs Exposed"
    },
    {
      "cover_image": "/podcast-covers/eye-am-everything.png",
      "legacy_url": "https://electracast.com/podcast/eye-am-everything/",
      "slug": "eye-am-everything",
      "source_dir": "Eye_Am_Everything",
      "summary": "“Eye am Everything” is a reminder that we are limitless. We are not just one role, one experience, one identity, or one story. We are human, and to be human is to be infinite. We are always evolving, always learning, always growing.  We contain multitudes: strength and softness, struggle and growth, wisdom and play, dark and light. We are EVERYTHING.",
      "title": "Eye Am Everything"
    },
    {
      "cover_image": "/podcast-covers/film-generations.jpg",
      "legacy_url": "https://electracast.com/podcast/film-generations/",
      "slug": "film-generations",
      "source_dir": "Film_Generations",
      "summary": "Which classic films still work for audiences today? On Film Generations, two guys born in the middle of 20th Century movie culture select a classic film to share with a panel of young film lovers — and see how it plays for today's generation.",
      "title": "Film Generations"
    },
    {
      "cover_image": "/podcast-covers/get-real-with-dr-ronaye.jpeg",
      "legacy_url": "https://electracast.com/podcast/get-real-with-dr-ronaye/",
      "slug": "get-real-with-dr-ronaye",
      "source_dir": "GET_REAL_with_Dr_Ronaye",
      "summary": "Welcome to Get Real with Dr Ronaye. Throughout her extensive experience as a double CEO and internationally recognized trauma specialist, Dr Calvert’s approach to recovery and emotional freedom is as unique and diverse as her clients. Dr Calvert’s holistic and compassionate perspective sheds light upon the journey of being human and encourages guests and listeners alike to GET REAL.  Joined by Bindi Heit, International Spiritual Coach and Mentor from Ethical Change Agency with the mission to spread collective change that makes the world a better place – understanding that it all starts with us.  It’s time to GET REAL.",
      "title": "GET REAL with Dr Ronaye"
    },
    {
      "cover_image": "/podcast-covers/ghost-hampton.jpg",
      "legacy_url": "https://electracast.com/podcast/ghost-hampton/",
      "slug": "ghost-hampton",
      "source_dir": "Ghost_Hampton",
      "summary": "The most mistrusted lawyer in the Hamptons, Lyle Hall, has had a change of life--the new Lyle is empathic and can hear people's thoughts. Including dead people. And they pose a growing threat.",
      "title": "Ghost Hampton"
    },
    {
      "cover_image": "/podcast-covers/healthy-delicious-lifestyle-with-claudine.jpg",
      "legacy_url": "https://electracast.com/podcast/healthy-delicious-lifestyle-with-claudine/",
      "slug": "healthy-delicious-lifestyle-with-claudine",
      "source_dir": "Healthy_Delicious_Lifestyle_With_Claudine",
      "summary": "Content Creator Claudine Francois is the Founder of Good Clean Taste.She is dedicated to helping women entrepreneurs design a healthy lifestyle by incorporating healthy and delicious tools, tips and resources that empower their inner and outer game on her globally recognized show Healthy Delicious Lifestyle With Claudine.",
      "title": "Healthy Delicious Lifestyle With Claudine"
    },
    {
      "cover_image": "/podcast-covers/her-extraordinary-life-by-design.png",
      "legacy_url": "https://electracast.com/podcast/her-extraordinary-life-by-design/",
      "slug": "her-extraordinary-life-by-design",
      "source_dir": "HER_Extraordinary_LIFE_By_Design",
      "summary": "Welcome to HER Extraordinary LIFE By Design, where we celebrate women who are shaping their lives one extraordinary day at a time.   Join your host Leslie Gaudet, Self-Care Coach, International Best-Selling Author, and Motivational Speaker, as she invites inspiring women from various walks of life to share their personal journeys and the pivotal moments that influenced their lives.   Together we’ll discover how they fearlessly carve their own paths as business owners, passionately pursue their dreams and create a meaningful impact on their communities.",
      "title": "HER Extraordinary LIFE By Design"
    },
    {
      "cover_image": "/podcast-covers/how-to-sell-show.jpeg",
      "legacy_url": "https://electracast.com/podcast/how-to-sell-show/",
      "slug": "how-to-sell-show",
      "source_dir": "How_To_Sell_Show",
      "summary": "The How To Sell Show will help you sell better and close more deals. This show will bring you the best interviews with Influence experts, authors, sales trainers, entrepreneurs, and even people you have never heard of. You can be a closer in sales!",
      "title": "How To Sell Show"
    },
    {
      "cover_image": "/podcast-covers/humanized-with-blue-telusma.jpeg",
      "legacy_url": "https://electracast.com/podcast/humanized-with-blue-telusma/",
      "slug": "humanized-with-blue-telusma",
      "source_dir": "Humanized_with_Blue_Telusma",
      "summary": "Humanized is back! But this time writer and cultural commentator Blue Telusma is re-imagining her Youtube series as a podcast with a bevy of colorful guests who are brave enough to get REAL about life, love, politics and every taboo subject in between.",
      "title": "Humanized with Blue Telusma"
    },
    {
      "cover_image": "/podcast-covers/infuse-compassion-podcast.jpg",
      "legacy_url": "https://electracast.com/podcast/infuse-compassion-podcast/",
      "slug": "infuse-compassion-podcast",
      "source_dir": "Infuse_Compassion_Podcast",
      "summary": "Infuse Compassion, a podcast hosted by Amy Quesenberry and Mark Carpenter, explores the transformative power of compassion in both professional and personal spheres.",
      "title": "Infuse Compassion Podcast"
    },
    {
      "cover_image": "/podcast-covers/lessons-from-the-fast-lane-with-peter-rafelson.jpeg",
      "legacy_url": "https://electracast.com/podcast/lessons-from-the-fast-lane-with-peter-rafelson/",
      "slug": "lessons-from-the-fast-lane-with-peter-rafelson",
      "source_dir": "LESSONS_FROM_THE_FAST_LANE_with_Peter_Rafelson",
      "summary": "Get ready to buckle up and accelerate into the world of Hollywood and cutting-edge technology with \"Lessons from the Fast Lane.\" Join your host, Peter Rafelson, as he takes you on a thrilling journey behind the scenes of Tinseltown, revealing insider secrets and captivating stories that will leave you on the edge of your seat. From the glitz and glamour of the red carpet to the disruptive innovations shaping our future, this podcast uncovers the untold tales of success, failure, and the invaluable lessons learned from both worlds. Rev your engines and ignite your curiosity as we explore the intersection of entertainment and technology like never before. It's time to hit the gas and tune in to \"Lessons from the Fast Lane\" for a ride you won't want to miss. An ElectraCast Production.",
      "title": "LESSONS FROM THE FAST LANE with Peter Rafelson"
    },
    {
      "cover_image": "/podcast-covers/let-s-talk-soul.png",
      "legacy_url": "https://electracast.com/podcast/let-s-talk-soul/",
      "slug": "let-s-talk-soul",
      "source_dir": "Let_s_Talk_Soul",
      "summary": "Embark on an extraordinary journey into the mystifying domain of the soul with 'Let's Talk Soul': a distinctive podcast that ventures fearlessly into the enigmatic universe of the soul. We don't pretend to have all the answers, but we promise to enrich your understanding through insightful observations and amusing narratives. This unparalleled podcast is your passport to discovering the soul's nature, existence, and expression in a lively, enlightening manner. Tune in for invigorating discussions that provide a novel, engaging, and intellectually stimulating viewpoint on the fascinating idea of the soul. So sit back, relax, and prepare to be captivated by 'Let's Talk Soul'. Enjoy the ride!",
      "title": "Let’s Talk Soul"
    },
    {
      "cover_image": "/podcast-covers/medicine-in-america.jpg",
      "legacy_url": "https://electracast.com/podcast/medicine-in-america/",
      "slug": "medicine-in-america",
      "source_dir": "Medicine_in_America",
      "summary": "Health care in the U.S. is confusing, costly and often fails people when they need it most. But change is happening. Join veteran health care media innovator Anthony Manson as he shares powerful stories from patients, caregivers and clinicians, alongside the innovation reshaping how we get care in America, real stories, bold ideas, a better future for healthcare.",
      "title": "Medicine in America"
    },
    {
      "cover_image": "/podcast-covers/missing-the-point.png",
      "legacy_url": "https://electracast.com/podcast/missing-the-point/",
      "slug": "missing-the-point",
      "source_dir": "Missing_the_Point",
      "summary": "Missing the Point is a one-hour podcast bringing you the biggest stories in the world of sports with a New England flavor. Joe Malkin, Michael Marcangelo, Bob Kelly, Dave Clarke, Rayshawn Buchanan, and Craig D’Alessandro go deep to bring analysis, criticism, praise, and overall humor. In addition to the regular shows, we offer numerous specialized episodes, game shows, trips back in time through New England’s dominance since 2000, and more!",
      "title": "Missing the Point"
    },
    {
      "cover_image": "/podcast-covers/music-medicine.jpg",
      "legacy_url": "https://electracast.com/podcast/music-medicine/",
      "slug": "music-medicine",
      "source_dir": "Music_Medicine",
      "summary": "“Music & Medicine” seeks to uplift the health of our entire planet by learning how musicians develop their sound and faced an important health issue in their lives. The show features Celebrity musicians, As they interview performing artists and industry insiders each week. Performing artists will also benefit from expert consultation and rehabilitation.",
      "title": "Music & Medicine"
    },
    {
      "cover_image": "/podcast-covers/nasa-daily.png",
      "legacy_url": "https://electracast.com/podcast/nasa-daily/",
      "slug": "nasa-daily",
      "source_dir": "NASA_Daily",
      "summary": "Straight from NASA itself, explore the daily activities, scientific experiments, and crucial maintenance tasks carried out by USA astronauts and researchers – all in four minutes or less. Stay updated with the freshest news from space, learning how the National Aeronautics and Space Administration, and the International Space Station, continue to push the boundaries of human knowledge and technology every day.",
      "title": "NASA Daily"
    },
    {
      "cover_image": "/podcast-covers/nightmare-road-stories.jpeg",
      "legacy_url": "https://electracast.com/podcast/nightmare-road-stories/",
      "slug": "nightmare-road-stories",
      "source_dir": "Nightmare_Road_Stories",
      "summary": "Comedian Alycia Cooper interviews her stand-up comic friends, who share their most insane, dangerous, salacious and hilarious tales of life as a performer on the road. An ElectraCast podcast.",
      "title": "Nightmare Road Stories"
    },
    {
      "cover_image": "/podcast-covers/no-judgement-podcast.jpeg",
      "legacy_url": "https://electracast.com/podcast/no-judgement-podcast/",
      "slug": "no-judgement-podcast",
      "source_dir": "No_Judgement_Podcast",
      "summary": "A podcast of funny, serious and unscripted life stories. Presented to you by real people, to bring awareness and entertainment.",
      "title": "No Judgement Podcast"
    },
    {
      "cover_image": "/podcast-covers/or-whatever-movies.png",
      "legacy_url": "https://electracast.com/podcast/or-whatever-movies/",
      "slug": "or-whatever-movies",
      "source_dir": "Or_Whatever_Movies",
      "summary": "Or Whatever Movies is a weekly entertainment discussion between real-life brother and sister duo, Wesley and Iris Ichishita. At under 30-minutes a pop, each episode is a quick, no-holds-barred discussion of a new or “favorite” movie.",
      "title": "Or Whatever Movies"
    },
    {
      "cover_image": "/podcast-covers/page-turner-s-studio-with-cori.jpg",
      "legacy_url": "https://electracast.com/podcast/page-turner-s-studio-with-cori/",
      "slug": "page-turner-s-studio-with-cori",
      "source_dir": "Page_Turner_s_Studio_With_Cori",
      "summary": "Content Creator Cori Wamsely is the founder of Aurora Corialis Publishing. She is dedicated to helping women entrepreneurs make a big impact by turning the next page with tools, tips, and resources that empower and connect the dots through books, publishing, and more on her globally recognized show Page-Turner's Studio With Cori. You can catch her show featuring women entrepreneurs who share their impactful words every Wednesday @ 7 AM PT, 9 AM CT.",
      "title": "Page-Turner’s Studio With Cori"
    },
    {
      "cover_image": "/podcast-covers/permission-to-live.png",
      "legacy_url": "https://electracast.com/podcast/permission-to-live/",
      "slug": "permission-to-live",
      "source_dir": "Permission_to_Live",
      "summary": "Welcome to Permission to Live, with your host, cult survivor and certified life coach, Melissa Lyon West. Hear powerful stories of women who turned their midlife crises into a badass life.We’ll share the good, the bad, and the ugly that comes when you finally say yes to yourself, and why it is always worth it. These stories, from women just like you, are messy, honest and 100% unfiltered. We'll be dropping new episodes every Wednesday where we interview women who found the courage to take a big, scary step towards their dream, the things they would have done differently, and how it looks on the other side.",
      "title": "Permission to Live"
    },
    {
      "cover_image": "/podcast-covers/poetics-of-place.jpg",
      "legacy_url": "https://electracast.com/podcast/poetics-of-place/",
      "slug": "poetics-of-place",
      "source_dir": "Poetics_of_Place",
      "summary": "Host Alastair Gordon explores the healing impact of good design in an increasingly complex and troubled world. He conducts spirited, in-depth interviews with some of the leading figures in the world of design, art, architecture and environmental awareness. Alastair is an award-winning critic, curator and author who has written for many publications including the New York Times, Wall Street Journal, Vanity Fair and Architectural Digest. \"Gordon's eye for the convergence of art, architecture and commerce is unerring.\"  - Publisher’s Weekly. An ElectraCast podcast.",
      "title": "Poetics of Place"
    },
    {
      "cover_image": "/podcast-covers/polly-campbell-simply-said.png",
      "legacy_url": "https://electracast.com/podcast/polly-campbell-simply-said/",
      "slug": "polly-campbell-simply-said",
      "source_dir": "Polly_Campbell_Simply_Said",
      "summary": "If you want to succeed in today’s changing business climate and create the life you desire, you’ll need to understand the psychology of success. Join author and entrepreneur Polly Campbell as she offers science-based success strategies and practical ideas you can adopt today, to build a better business and create a life you want to live.",
      "title": "Polly Campbell, Simply Said"
    },
    {
      "cover_image": "/podcast-covers/power-suits-pillow-talk.jpeg",
      "legacy_url": "https://electracast.com/podcast/power-suits-pillow-talk/",
      "slug": "power-suits-pillow-talk",
      "source_dir": "Power_Suits_Pillow_Talk",
      "summary": "Join Laurie Handlers and Jen Coken as they dismantle corporate barriers and unravel bedroom myths. This podcast applauds women for smashing career limitations and demystifying intimate enigmas. Experience this journey of empowerment and self-discovery, where professional success meets personal liberation.",
      "title": "Power Suits & Pillow Talk"
    },
    {
      "cover_image": "/podcast-covers/psychic-visions-podcast.jpg",
      "legacy_url": "https://electracast.com/podcast/psychic-visions-podcast/",
      "slug": "psychic-visions-podcast",
      "source_dir": "Psychic_Visions_Podcast",
      "summary": "Psychic best friends and Hosts, Jason Zuk and Megan Kane invite you to delve into the supernatural and metaphysical worlds. Have you ever experienced deja-vu or thought about someone, and then they message or call you? Maybe you have walked into an old building, and get goosebumps or chills down your spine? Chances are, you're having spiritual experiences without even realizing it. To some, these signs are mere coincidences, but to those who have had a \"spiritual awakening\", we know there's more than meets the eye. The \"paranormal\" is normal, and subjects that were once considered \"taboo\" are a part of our every day lives. Join Megan and Jason, and their special featured guests as they discuss spirituality, life after death, energy healing, astral projection, psychic abilities, mediumship and more. Featuring Hollywood actors turned reiki healers, to every day people manifesting their wildest dreams and becoming household names. Meet Emmy Award-Winning masterminds, philosophers, and thought-leaders alike to the visionaries behind \"The Secret.\" Follow us where all podcasts are available and don't forget to check out us out and to add us on Instagram: @PsychicVisionsPodcast. Our Show is signed with ElectraCast Media, and our Executive Producers are Mark Netter and Peter Rafelson.   Thanks to Yvette Lopez for supporting our show as a Producer.   You can find out more information about ElectraCast Media online at Electracast.com.   Harness Your Inner Power.",
      "title": "Psychic Visions Podcast"
    },
    {
      "cover_image": "/podcast-covers/pure-truth.jpeg",
      "legacy_url": "https://electracast.com/podcast/pure-truth/",
      "slug": "pure-truth",
      "source_dir": "Pure_Truth",
      "summary": "Through a divine appointment from God, Kathy, Susan, and Laura have come together to share the things that God has poured into them through their intimate relationship with Him. Their encouraging testimonies of faith, revelatory understanding through visions and dreams, and exploring the Heavenly realms will inspire you to desire a more intimate relationship with God for yourself. This podcast is not for those who want more religion, but for those who desire to go deeper and possibly open your eyes to things you've never experienced before in a relationship with God. It doesn't matter where you are on your spiritual journey, the testimonies and revelations they have received can help you grow closer in your relationship with God. If you have any questions regarding our podcast or suggestions for topics of discussion, please email us at: puretruthpodcast3@gmail.com. It's always a pleasure to pour out God's pure truth!",
      "title": "Pure Truth"
    },
    {
      "cover_image": "/podcast-covers/red-white-and-buddha.jpeg",
      "legacy_url": "https://electracast.com/podcast/red-white-and-buddha/",
      "slug": "red-white-and-buddha",
      "source_dir": "Red_White_and_Buddha",
      "summary": "Welcome to \"Red White and Buddha,\" where host Shawn Kellner invites you to embark on a transformative journey through the spectrum of the human experience. This podcast transcends boundaries, tracing the path from the tumultuous chaos of war to the serene haven of peace. Along the way, we discuss mental health challenges, share stories of resilience and hope, and uncover the incredible strength within us all.What sets our podcast apart is Shawn's remarkable life story, including his globe-trotting adventures. Prepare for heart-pounding tales of danger and wild escapades, such as volcano boarding down an active volcano in Nicaragua to immersive travel through the Mekong Delta wearing his VFW hat on Memorial Day   Our bi-weekly episodes, each approximately 45 minutes long, promise an emotional rollercoaster. From heartwarming moments of inspiration to jaw-dropping adventures, \"Red White and Buddha\" is a harmonious blend of fun, informative insights, emotional depth, shock and awe, and the ever-present element of danger. Our tone is a captivating fusion of lightheartedness, information, emotion, shock and awe, adventure, and a heartfelt, authentic connection that inspires hope.Join us on this extraordinary voyage. Subscribe now to \"Red White and Buddha\" and get ready to explore the world, overcome life's obstacles, and discover the remarkable power of resilience and hope. If you enjoy our show, please share it with a friend and help us spread the message of inspiration and the transformative power of storytelling.",
      "title": "Red White and Buddha"
    },
    {
      "cover_image": "/podcast-covers/ringside-with-ray-prince.png",
      "legacy_url": "https://electracast.com/podcast/ringside-with-ray-prince/",
      "slug": "ringside-with-ray-prince",
      "source_dir": "Ringside_with_Ray_Prince",
      "summary": "Join Ray Leonard Jr., the son of a super boxing champion, and Prince Daniels Jr., a former NFL running-back, as they entertain, empower, and educate you with the best conversation with the biggest names in sports and entertainment. We look to take you ringside and give you the inside scoop that you are looking for with some of the best stories and insights you can find anywhere! Join us Tuesdays at 10 am PST wherever you get your podcasts to join our journey as we look to give you all VIP access to the most interesting personalities in sports, business, and entertainment!",
      "title": "Ringside with Ray & Prince"
    },
    {
      "cover_image": "/podcast-covers/sales-is-easy.png",
      "legacy_url": "https://electracast.com/podcast/sales-is-easy/",
      "slug": "sales-is-easy",
      "source_dir": "Sales_is_Easy",
      "summary": "Sales is Easy is a place where we simplify and demystify the sales process, and help you with learning the formula to overcome setbacks and make sales easy. When done by a skilled professional, sales IS easy. It takes skill, drive, dedication, and access to the right tools and techniques. We will change your approach to sales that will make you comfortable in your sales role and help you sell more. You will also learn how to avoid being seen as a traditional pushy salesperson that doesn’t take no for an answer, who doesn’t seem to be listening to his customers and trying to sell you something you don’t want. Follow this podcast and learn the right tools and secrets of professional salespeople to create a process that is straightforward, easy to follow, and make it easy for your customers to buy from you.",
      "title": "Sales is Easy!"
    },
    {
      "cover_image": "/podcast-covers/sideline-sports.jpeg",
      "legacy_url": "https://electracast.com/podcast/sideline-sports/",
      "slug": "sideline-sports",
      "source_dir": "Sideline_Sports",
      "summary": "Sideline Sports is a sports show hosted by JB, Jon, Eric & Jake. The guys cover the MLB, NBA, NFL, and NHL weekly.",
      "title": "Sideline Sports"
    },
    {
      "cover_image": "/podcast-covers/simply-write-w-polly.png",
      "legacy_url": "https://electracast.com/podcast/simply-write-w-polly/",
      "slug": "simply-write-w-polly",
      "source_dir": "Simply_Write_w_Polly",
      "summary": "Have you always dreamed of writing? Of becoming a published author? Then you are in the right place, because in this podcast Simply Write, veteran magazine writer and author, Polly Campbell offers practical, behind-the-screens information and inspiration that will help you shape a writing career. We'll go deep into writing technique, mindset, markets, pitches, and craft and talk with best-selling award-winning authors about how they get the writing done and published and how you can do it too. Join us every Monday when we talk about the craft of writing and the quirks of creating a writer's life.",
      "title": "Simply Write w/Polly"
    },
    {
      "cover_image": "/podcast-covers/spiritually-restored.png",
      "legacy_url": "https://electracast.com/podcast/spiritually-restored/",
      "slug": "spiritually-restored",
      "source_dir": "Spiritually_Restored",
      "summary": "You were created for a more purposeful life! Do you have the faith to keep going? Do you believe that God wants more for you? Ashley D with Spiritually Restored will dive in on everyday challenges to bring truth through the Word of God and relatable testimonies; Sharing the faith with you as a pathway for all to see that no one is perfect but we are all being perfected through Christ Jesus.",
      "title": "Spiritually Restored"
    },
    {
      "cover_image": "/podcast-covers/starfleet-leadership-academy.png",
      "legacy_url": "https://electracast.com/podcast/starfleet-leadership-academy/",
      "slug": "starfleet-leadership-academy",
      "source_dir": "Starfleet_Leadership_Academy",
      "summary": "Star Trek is full of great examples of leadership. Jeff Akin, a leader with over 20 years of executive management experience in both the public and private sectors, breaks down each episode of Star Trek, from The Original Series to Discovery, and beyond; pointing out examples of great leadership, management, lean/six-sigma, communication and more. If you enjoy Star Trek, or are even a little Trek-curious, and have an appetite for leadership development, this is the podcast for you.",
      "title": "Starfleet Leadership Academy"
    },
    {
      "cover_image": "/podcast-covers/steps-to-feel-good-daily-with-lona.jpg",
      "legacy_url": "https://electracast.com/podcast/steps-to-feel-good-daily-with-lona/",
      "slug": "steps-to-feel-good-daily-with-lona",
      "source_dir": "Steps_To_Feel_Good_Daily_With_Lona",
      "summary": "Content Creator Lona DeRieux is a Wellness Advocate and Energy Worker. She helps women entrepreneurs create a balanced and healthy lifestyle by providing tools, tips and resources that elevates health from the inside out on her globally recognized show Steps To Feel Good Daily With Lona.",
      "title": "Steps To Feel Good Daily With Lona"
    },
    {
      "cover_image": "/podcast-covers/swe-spotlight-with-joie.jpeg",
      "legacy_url": "https://electracast.com/podcast/swe-spotlight-with-joie/",
      "slug": "swe-spotlight-with-joie",
      "source_dir": "SWE_Spotlight_With_Joie",
      "summary": "Content Creator Joie Gharrity is the Founder of Superstar Women Entrepreneurs Media Network and Joie G 113. She is dedicated to empowering women entrepreneurs to create a beautiful personal and professional lifestyle by spotlighting superstar tools, tips and resources that gain them ease and grace on her globally recognized show SWE Spotlight With Joie.",
      "title": "SWE Spotlight With Joie"
    },
    {
      "cover_image": "/podcast-covers/synclove.jpeg",
      "legacy_url": "https://electracast.com/podcast/synclove/",
      "slug": "synclove",
      "source_dir": "SyncLove",
      "summary": "Explore the magic of music in film. Kirt Debique interviews the top music supervisors and media experts who electrify movies with music that makes us cry, laugh, jump and dance, transforming star performances and the very meanings of films.",
      "title": "SyncLove"
    },
    {
      "cover_image": "/podcast-covers/techtalk-revolution.png",
      "legacy_url": "https://electracast.com/podcast/techtalk-revolution/",
      "slug": "techtalk-revolution",
      "source_dir": "TechTalk_Revolution",
      "summary": "Jonny Caplan and Jessy Katz take you on an eye-opening journey to discover revolutionary new technology start-ups around the world. From the multiple award-winning TechTalk TV series as seen on Amazon, Apple and Google. An ElectraCast podcast.",
      "title": "TechTalk Revolution"
    },
    {
      "cover_image": "/podcast-covers/terra-nova.jpeg",
      "legacy_url": "https://electracast.com/podcast/terra-nova/",
      "slug": "terra-nova",
      "source_dir": "Terra_Nova",
      "summary": "Humanity has reached a crossroads. We have the power and resources to disrupt the status quo and create the future we want for ourselves and our communities. We are starting to see the rise of a regenerative future - the emergence of terra nova. People all over the world are waking up and ready to make real change. Our intention is to connect a global network of rule breakers dedicated to cultivating a better future. Our mission is to integrate ancient wisdom with today’s cutting-edge science and technology to solve the issues of today to create a better tomorrow. This community supports the regeneration of ourselves, our work, our communities, and our planet. We all have a role to play in ushering in this new world. Thank you for choosing to be here. Your unique gifts are needed for where we’re going. The Terra Nova podcast is a storytelling platform dedicated to exploring all facets of the human condition. We dive deep into our shared history and discuss evidence-based approaches to evolving our way of life. In addition to interviewing leaders and visionaries in science, spirituality, and conscious entrepreneurism, we will also feature stories directly from our community of listeners. To learn more about the Terra Nova movement and how to get plugged into our community, please visit",
      "title": "Terra Nova"
    },
    {
      "cover_image": "/podcast-covers/the-barry-bonkers-show.jpeg",
      "legacy_url": "https://electracast.com/podcast/the-barry-bonkers-show/",
      "slug": "the-barry-bonkers-show",
      "source_dir": "The_Barry_Bonkers_Show",
      "summary": "Barry Bonkers hosts special guests and shares emotionally charged, open dialog with no holds barred excepting that all must demonstrate Civility, Tolerance, and Respect.",
      "title": "The Barry Bonkers Show"
    },
    {
      "cover_image": "/podcast-covers/the-box-god-dare-to-believe.png",
      "legacy_url": "https://electracast.com/podcast/the-box-god-dare-to-believe/",
      "slug": "the-box-god-dare-to-believe",
      "source_dir": "The_Box_God_Dare_to_Believe",
      "summary": null,
      "title": "The Box God: Dare to Believe"
    },
    {
      "cover_image": "/podcast-covers/the-c-word.png",
      "legacy_url": "https://electracast.com/podcast/the-c-word/",
      "slug": "the-c-word",
      "source_dir": "The_C_Word",
      "summary": "The C Word uncovers ten personalities that can be encountered in today's churches. It reveals \"the why\" that we see in many church behaviors. From the new convert or the novice to the mature believer, the content will challenge you in your faith walk. Motivating believers to display life-changing behavior and become more Christ-like.",
      "title": "The C Word"
    },
    {
      "cover_image": "/podcast-covers/the-candlepower-hour.jpg",
      "legacy_url": "https://electracast.com/podcast/the-candlepower-hour/",
      "slug": "the-candlepower-hour",
      "source_dir": "The_Candlepower_Hour",
      "summary": "The show must go on! As it has for centuries…Time marches on & technology evolves, but some things never change: the human story & experience. Welcome to The Candlepower Hour. Our platform is here to deliver the human element of show business. Entertainment to shock, educate & inspire. Spanning over four decades of music, film & television. With Host & Executive Producers Diego Negrete & Bill Metoyer. Join us! & let's get the show on the road...",
      "title": "The Candlepower Hour"
    },
    {
      "cover_image": "/podcast-covers/the-curse-of-the-lake-house.jpeg",
      "legacy_url": "https://electracast.com/podcast/the-curse-of-the-lake-house/",
      "slug": "the-curse-of-the-lake-house",
      "source_dir": "The_Curse_of_The_Lake_House",
      "summary": "The Curse of the Lake House is a one-act, anthology-style play by Michael Grover about family, relationships, and a lake house. 8 individual stories, The Curse of The Lake House is a dark comedy that follows two families over 450 years as they try to shake the curse that haunts them.",
      "title": "The Curse of The Lake House"
    },
    {
      "cover_image": "/podcast-covers/the-ethical-evolution-podcast.jpg",
      "legacy_url": "https://electracast.com/podcast/the-ethical-evolution-podcast/",
      "slug": "the-ethical-evolution-podcast",
      "source_dir": "The_Ethical_Evolution_Podcast",
      "summary": "There’s a change happening in the way we live, the way we work, the way we spend our money and make our decisions - we are evolving to be more conscious in our actions in a way that serves the world and makes it a better place. Welcome to The Ethical Evolution, where the mission is to spread the stories of collective change that make the world a better place, understanding that it all begins with us.",
      "title": "The Ethical Evolution Podcast"
    },
    {
      "cover_image": "/podcast-covers/the-geo-godfather-wars.jpg",
      "legacy_url": "https://electracast.com/podcast/the-geo-godfather-wars/",
      "slug": "the-geo-godfather-wars",
      "source_dir": "The_Geo_Godfather_Wars",
      "summary": "Barak Seener, Leah Tedrow and guest experts offer an analytical approach to geopolitics enabling viewers to be ahead of the curve and effectively mitigate risk. In an age of disinformation and changing trade & business practices, companies as well as members of the public want to sift between real and ‘fake news’ and have a deeper understanding of future trends and how global affairs are interconnected. Our security and economic landscapes are impacted by Coronavirus, a rising China, a resurgent Russia & a nuclear aspiring Iran leading to shifting trade patterns, heightening risk to industries & investment portfolios, creating barriers to entry to foreign markets & creating market volatility.",
      "title": "The Geo-Godfather Wars"
    },
    {
      "cover_image": "/podcast-covers/the-last-saturday-night.jpeg",
      "legacy_url": "https://electracast.com/podcast/the-last-saturday-night/",
      "slug": "the-last-saturday-night",
      "source_dir": "The_Last_Saturday_Night",
      "summary": "It seems like a lifetime ago. So much has happened since then, from sanitizer shortages to European escapes. Restaurants and nations alike have been forced to shut down, wildfires and riots have devastated California, and Russians tried to influence our election. Heck, it’s hard to remember a time before Zoom meetings galore!",
      "title": "The Last Saturday Night"
    },
    {
      "cover_image": "/podcast-covers/the-lawrence-ross-show.png",
      "legacy_url": "https://electracast.com/podcast/the-lawrence-ross-show/",
      "slug": "the-lawrence-ross-show",
      "source_dir": "The_Lawrence_Ross_Show",
      "summary": "A blind man who calls it like he \"sees\" it.",
      "title": "The Lawrence Ross Show"
    },
    {
      "cover_image": "/podcast-covers/the-marketing-mirror.png",
      "legacy_url": "https://electracast.com/podcast/the-marketing-mirror/",
      "slug": "the-marketing-mirror",
      "source_dir": "The_Marketing_Mirror",
      "summary": "The Marketing Mirror promises to deliver insights, ideas, and strategies—simple to complex— to unravel marketing secrets to infuse into your business every day. Join Sue-Ann Bubacz and friends on a journey into The Marketing Mirror to reflect on how to effectively improve your marketing to win more business. And hearts.",
      "title": "The Marketing Mirror"
    },
    {
      "cover_image": "/podcast-covers/the-naturebacked-podcast.png",
      "legacy_url": "https://electracast.com/podcast/the-naturebacked-podcast/",
      "slug": "the-naturebacked-podcast",
      "source_dir": "The_NatureBacked_Podcast",
      "summary": "At NatureBacked, we talk with investors and entrepreneurs worldwide about climate change, covering everything from CO2 emissions to floods to guests’ personal choices for turning the world greener.In this podcast, we bring you inspiring stories and insights from experts, innovators, and changemakers who are working to protect and restore our planet. Whether you are interested in wildlife, ecology, conservation, climate change, or green living, this podcast is for you.",
      "title": "The NatureBacked Podcast"
    },
    {
      "cover_image": "/podcast-covers/the-neighborhood-podcast.jpeg",
      "legacy_url": "https://electracast.com/podcast/the-neighborhood-podcast/",
      "slug": "the-neighborhood-podcast",
      "source_dir": "The_Neighborhood_Podcast",
      "summary": "At The Neighborhood Podcast, our mission is to give you a genuine and unfiltered listening experience on everything sports. For each episode, we dive into the major sports stories of the day, analyze interesting sports articles, interviews and opinions and touch on current events in pop culture. Two episodes of the podcast will be uploaded on a weekly basis and each episode will be available on Spotify, Apple Podcasts, Google Podcasts and YouTube.",
      "title": "The Neighborhood Podcast"
    },
    {
      "cover_image": "/podcast-covers/the-new-feminist.png",
      "legacy_url": "https://electracast.com/podcast/the-new-feminist/",
      "slug": "the-new-feminist",
      "source_dir": "The_New_Feminist",
      "summary": "Jill Sorensen gives the scoop on common sense feminism from a new perspective. Featuring in-depth interviews and satirical take-downs of pop culture, The New Feminist podcast explores women's issues and gender inequality with humor and sincerity.",
      "title": "The New Feminist"
    },
    {
      "cover_image": "/podcast-covers/the-patrick-bass-show.png",
      "legacy_url": "https://electracast.com/podcast/the-patrick-bass-show/",
      "slug": "the-patrick-bass-show",
      "source_dir": "The_Patrick_Bass_Show",
      "summary": "The Patrick Bass Show - your gateway to uncovering the extraordinary. Join us live every weekday from 5 PM to 6 PM as we explore the mysteries that shape our world. Each episode features top guests from diverse backgrounds, engaging in thought-provoking discussions that challenge the status quo and push the boundaries of conventional thinking.",
      "title": "The Patrick Bass Show"
    },
    {
      "cover_image": "/podcast-covers/the-purpose-effect.jpg",
      "legacy_url": "https://electracast.com/podcast/the-purpose-effect/",
      "slug": "the-purpose-effect",
      "source_dir": "The_Purpose_Effect",
      "summary": "✨ The Purpose Effect Podcast — with Alesha Limbo & David (Your Purpose Duo) ✨",
      "title": "The Purpose Effect"
    },
    {
      "cover_image": "/podcast-covers/the-responsible-leadership-podcast.png",
      "legacy_url": "https://electracast.com/podcast/the-responsible-leadership-podcast/",
      "slug": "the-responsible-leadership-podcast",
      "source_dir": "The_Responsible_Leadership_Podcast",
      "summary": "The Responsible Leadership Podcast is a production of The Leadership Phalanx (www.leadershipphalanx.com).",
      "title": "The Responsible Leadership Podcast"
    },
    {
      "cover_image": "/podcast-covers/the-social-psychic-radio-show.jpeg",
      "legacy_url": "https://electracast.com/podcast/the-social-psychic-radio-show/",
      "slug": "the-social-psychic-radio-show",
      "source_dir": "The_Social_Psychic_Radio_Show",
      "summary": "Originally this podcast focused exclusively on topics surrounding Spirituality. With recent events and the turmoil concerning the murder of George Floyd at the hands of the Minneapolis Police Department along with the murders of countless others, a major paradigm shift is underway within our society. This show will expand its programming to include topics that highlight our desire to eradicate inequality, systemic racism, and to gain greater accountability from our elected leaders and the law enforcement community so that we as a society can improve the lives of millions. Jason offers a unique perspective as an Attorney and Psychic Medium and within the context of Spirituality. As an attorney, Jason is licensed to practice law in Florida, Mississippi, Alabama, Texas and New Jersey. He received his legal training by earning his Juris Doctorate from Nova Southeastern University and by attaining a Masters of Law (LL.M.) in International Law and Comparative Law from Georgetown University. Jason realized his psychic abilities immediately following his grandfather’s death in 2004 after he began to experience significant spiritual events that caused his mediumship abilities to flourish over time. Jason believes by coming together from a spiritual approach we can engage in healthy and constructive dialogue with the goal of gaining a greater understanding and awareness of these complex issues so that true reform can result. Jason supports the Black Lives Matter Movement. While Spiritual Topics will continue to be an important part of the show, Jason will also present topics addressing the desire to protect our Environment, Reform our Criminal Justice System, and Safeguard every Citizen from Police Brutality. \"We the People Means EVERYONE.\"",
      "title": "The Social Psychic Radio Show"
    },
    {
      "cover_image": "/podcast-covers/the-toekenz-podcast.jpeg",
      "legacy_url": "https://electracast.com/podcast/the-toekenz-podcast/",
      "slug": "the-toekenz-podcast",
      "source_dir": "The_Toekenz_Podcast",
      "summary": "Hosted by Toekenz Collectibles CEO and Co-Founder Iris Ichishita and Marketing Advisor Jeff Allen, the Toekenz Podcast is a weekly podcast where our team opens up the world of NFTs to the crypto-curious. We want to provide families with a safe and fun place to enter into Web3 and empower the next generation to dominate in the metaverse.",
      "title": "The Toekenz Podcast"
    },
    {
      "cover_image": "/podcast-covers/think-business-with-tyler.png",
      "legacy_url": "https://electracast.com/podcast/think-business-with-tyler/",
      "slug": "think-business-with-tyler",
      "source_dir": "Think_Business_with_Tyler",
      "summary": "Tyler Martin talks with CEOs and Business Owners about the challenges, failures, and successes of growing and scaling a business. Tyler and his guests tackle tough issues like owner burnout, efficient methods to grow revenue, leadership problems, staff turnover, and the best way to position your business for sale when that time comes. Every episode promises to be entertaining, fast-paced, and educational with the main goal to take YOU and your business to the next level.",
      "title": "Think Business with Tyler"
    },
    {
      "cover_image": "/podcast-covers/transforming-45.jpeg",
      "legacy_url": "https://electracast.com/podcast/transforming-45/",
      "slug": "transforming-45",
      "source_dir": "Transforming_45",
      "summary": "Welcome to \"Transforming 45,\" the podcast that celebrates transformation . I'm your host Lisa Boate, and I am thrilled to embark on this transformative journey with you.",
      "title": "Transforming 45"
    },
    {
      "cover_image": "/podcast-covers/tru-talks-about-theater.jpeg",
      "legacy_url": "https://electracast.com/podcast/tru-talks-about-theater/",
      "slug": "tru-talks-about-theater",
      "source_dir": "TRU_Talks_About_Theater",
      "summary": "TRU, or Theater Resources Unlimited, was formed to promote a spirit of cooperation and support within the general theatre community by providing information and a variety of entertainment-related services and resources that strengthen the capacity of producing organizations, individuals producers, self-producing artists and other theater professionals.",
      "title": "TRU Talks About Theater"
    },
    {
      "cover_image": "/podcast-covers/tune-into-sound-wellbeing.jpg",
      "legacy_url": "https://electracast.com/podcast/tune-into-sound-wellbeing/",
      "slug": "tune-into-sound-wellbeing",
      "source_dir": "Tune_Into_Sound_Wellbeing",
      "summary": "Tuning Into Sound Wellbeing is here to educate, inspire, and empower listeners on their wellness journey through the transformative world of sound therapy and tuning forks. By creating a space for both novices and enthusiasts we break down complex concepts, share relatable stories and guide you through techniques that integrate sound into your daily life.",
      "title": "Tune Into Sound Wellbeing"
    },
    {
      "cover_image": "/podcast-covers/unapologetically-fab.png",
      "legacy_url": "https://electracast.com/podcast/unapologetically-fab/",
      "slug": "unapologetically-fab",
      "source_dir": "Unapologetically_Fab",
      "summary": "Stefany Baclaan & Eden Alpert share perspectives on being UNAPOLOGETICALLY FAB, changing the narrative, leaning into who you are by creating and navigating a ‘LIFE BY DESIGN”, purposefully - designing each element of your world, from family, business and friends toward your definition of success. It doesn’t mean that your life is perfect, but it does mean that you’re living intentionally and with passion, knowing exactly where you want to go, and who you want to be - unapologetically.",
      "title": "Unapologetically Fab"
    },
    {
      "cover_image": "/podcast-covers/who-the-f-is-roger-smith.png",
      "legacy_url": "https://electracast.com/podcast/who-the-f-is-roger-smith/",
      "slug": "who-the-f-is-roger-smith",
      "source_dir": "Who_The_F_Is_Roger_Smith",
      "summary": "Roger Smith is the most interesting person you've never heard of. He's worked with and met some of the most famous and powerful people in entertainment and politics and lived through some amazing times. He's also quite modest, but host Bill McCuddy gets Roger to name names and tell some truly fascinating stories.",
      "title": "Who The F*** Is Roger Smith?!?"
    },
    {
      "cover_image": "/podcast-covers/wine-wisdom.png",
      "legacy_url": "https://electracast.com/podcast/wine-wisdom/",
      "slug": "wine-wisdom",
      "source_dir": "Wine_Wisdom",
      "summary": "Wine & Wisdom is girl’s night meets spiritual enlightenment with a splash of optimism.",
      "title": "Wine & Wisdom"
    },
    {
      "cover_image": "/podcast-covers/won-a-bet.jpeg",
      "legacy_url": "https://electracast.com/podcast/won-a-bet/",
      "slug": "won-a-bet",
      "source_dir": "Won_A_Bet",
      "summary": "Every week on the Won A Bet podcast, two friends, former colleagues, amateur sports betting enthusiasts put their handicapping knowledge to the test.  Each week David and Miles make $1k worth of bets on the games that they like the best.  They primarily focus on the the NFL, but every now and then they throw in bets on college football, playoff baseball or the NBA to spice things up.",
      "title": "Won A Bet"
    }
  ]
}
